Documents/НазначениеПлановогоНачисления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>НазначениеПлановогоНачисления</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Начисление</Name>
					<Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.Начисления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДатаНазначения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ВидТарифнойСтавки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыТарифныхСтавок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Размер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СовокупнаяТарифнаяСтавка</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЗначениеПоказателяРасчетаЗарплаты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ИдентификаторСтрокиСотрудника</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КоэффициентИндексации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>10</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/НазначениеПлановогоНачисления/Ext/ManagerModule.bsl
Процедура ПечатьПриказаОСтимулирующих(ТабДок, Ссылка) Экспорт
   Макет = Документы.НазначениеПлановогоНачисления.ПолучитьМакет("ПФ_MXL_ПриказОСтимулирующих");
   Запрос = Новый Запрос;
   Запрос.Текст = "ВЫБРАТЬ
                  |	НазначениеПлановогоНачисленияСотрудники.Ссылка КАК Ссылка,
                  |	НазначениеПлановогоНачисленияСотрудники.НомерСтроки КАК НомерСтроки,
                  |	НазначениеПлановогоНачисленияСотрудники.Сотрудник КАК Сотрудник,
                  |	НазначениеПлановогоНачисленияСотрудники.ДатаНазначения КАК ДатаНазначения,
                  |	НазначениеПлановогоНачисленияСотрудники.ДатаОкончания КАК ДатаОкончания,
                  |	НазначениеПлановогоНачисленияСотрудники.Размер КАК Размер
				  //|	НазначениеПлановогоНачисленияСотрудники.ИдентификаторСтрокиСотрудника КАК ИдентификаторСтрокиСотрудника,
				  //|	НазначениеПлановогоНачисленияСотрудники.КоэффициентИндексации КАК КоэффициентИндексации
                  |ИЗ
                  |	Документ.НазначениеПлановогоНачисления.Сотрудники КАК НазначениеПлановогоНачисленияСотрудники
                  |ГДЕ
                  |	НазначениеПлановогоНачисленияСотрудники.Ссылка = &Ссылка"; //сам текст запроса нам не принципиален
   Запрос.Параметры.Вставить("Ссылка", Ссылка); //в качестве параметра указываем Ссылку – параметр процедуры
   Выборка = Запрос.Выполнить().Выбрать();

   Шапка = Макет.ПолучитьОбласть("Шапка");
   Шапка.Параметры.Заполнить(Ссылка);
   ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
   ТабДок.Очистить();

   ВставлятьРазделительСтраниц = Ложь;
   Шапка.Параметры.Заполнить(Выборка);
   Шапка.Параметры.Дата = Формат(Ссылка.Дата, "ДЛФ=DD");
   Шапка.Параметры.ОГРН = Ссылка.Организация.ОГРН;
   Шапка.Параметры.ИНН = Ссылка.Организация.ИНН;
   Шапка.Параметры.Организация = Ссылка.Организация.НаименованиеПолное;
   Шапка.Параметры.Номер = Ссылка.Номер;
   Шапка.Параметры.Адрес = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Ссылка.Организация, Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации, Ссылка.Дата, Истина);
   Шапка.Параметры.Месяц = Формат(Ссылка.Дата, "ДФ='ММММ гггг'");
   
   ТабДок.Вывести(Шапка);
   
   Пока Выборка.Следующий() Цикл
	   ОбластьСтрока.Параметры.Заполнить(Выборка);
	   ТабДок.Вывести(ОбластьСтрока);
   КонецЦикла;
   
   Структура=ЗарплатаКадры.ОтветственныеЛицаОрганизации(Ссылка.Организация,"Руководитель,ДолжностьРуководителя",ТекущаяДата());
   
   Подвал = Макет.ПолучитьОбласть("Подвал");
   Подвал.Параметры.РуководительДолжность = Структура.ДолжностьРуководителя;
   Подвал.Параметры.Руководитель = "" + Структура.Руководитель.Фамилия + " " + Структура.Руководитель.Инициалы;
   
   ТабДок.Вывести(Подвал);
   
   
КонецПроцедуры
